shalaev.org
#+TITLE: useful lisp macros and functions
#+AUTHOR: Oleg Shalaev
#+EMAIL:  oleg@chalaev.com
#+LaTeX_HEADER: \usepackage[russian,english]{babel}
#+LATEX_HEADER: \usepackage[letterpaper,hmargin={1.5cm,1.5cm},vmargin={1.3cm,2cm},nohead,nofoot]{geometry}
#+KEYWORDS: emacs, elisp, common lisp, macros, functions

* introduction
Notes:
1. Evaluation results are important part of this file, but =github= org-parser does not show them.
   (BTW [[https://notabug.org/shalaev/lisp-goodies/src/master/goodies.org][notabug does show them]] although unformatted.)  Consider opening this file in ~emacs~ instead of watching it online.
2. Sometimes a demonstration of a function might use the definition of another function defined below in this file or another
   file from the ~generated/~ directory, so you might need to =load= those first.

#+BEGIN_SRC lisp :tangle generated/shalaev.lisp
;; empty file needed for Makefile
#+END_SRC

* when-let
** Emacs Lisp
(in latest emacs) =when-let= and =when-let*= are defined in ~subr-x.el~:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el :shebang ";; -*-  lexical-binding: t; -*-"
(require 'subr-x)
#+END_SRC

=when-let= is one of my most-used macros; it is defined on top of (more general) =when-let-key=:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(unless (< 25 (car (emacs-ver)))
(defmacro when-let-key(key vars &rest body)
  "when with let using standard let-notation, but every item in vars must be a list"
  (if (car vars)
  `(let ((,(caar vars) ,(cadar vars)))
     ,(if (cdr vars)
	  `(when (funcall ,key ,(caar vars))
	     ,(macroexpand-1 `(when-let-key ,key ,(cdr vars) ,@body)))
	(append `(when (funcall ,key ,(caar vars))) body)))
  (if (cdr vars)
      `(when ,(cadar vars)
	     ,(macroexpand-1 `(when-let-key ,key ,(cdr vars) ,@body)))
    (append `(when (funcall ,key ,(cadar vars))) body)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el :shebang ";; -*-  lexical-binding: t; -*-"
(unless (< 25 (car (emacs-ver)))
(ert-deftest when-let-key()
(should (string= "aba" (when-let-key  #'identity ((a "a") (b (concat a "b")))
  (concat b "a"))))
(should (not (when-let-key  #'identity ((a "a") (b nil)) (concat "z" "a"))))
(should (not (when-let-key  #'identity ((c nil) (a "a") (b nil)) (concat "z" "a"))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(unless (< 25 (car (emacs-ver)))
(defmacro when-let*(vars &rest body)
  "when with let using standard let-notation"
`(when-let-key #'identity
   ,(mapcar #'(lambda(v) (if(listp v) v (list v nil))) vars)
    ,@body)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(unless (< 25 (car (emacs-ver)))
(ert-deftest when-let*()
(should (string= "aba" 
   (when-let* ((a "a") (b (concat a "b")))
      (concat b "a"))))
(should (not (when-let* ((a "a") (b)) (concat "z" "a"))))
(should (not (when-let* (c (a "a") b) (concat "z" "a"))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest when-let()
  "Testing here when-let and when-let* defined in subr-x.el"
(should (string= "ba" (when-let (a "a") (concat "b" a))))
(should (string= "ba" (when-let ((a "a")) (concat "b" a))))
(should (string= "ba" (when-let ((a "a") (b "b")) (concat b a))))
(should (string= "aba" (when-let ((a "a") (b (concat a "b"))) (concat b "a"))))
(should (string= "aba" (when-let* ((a "a") (b (concat a "b"))) (concat b "a")))))
#+END_SRC
← =when-let= is /almost/ identical to =when-let*=.

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest if-let*()
  "Testing here if-let* defined in subr-x.el"
:expected-result (if (< 25 (car (emacs-ver))) :passed :failed)
(should (= 1 (if-let* ((a 3)) 1 2)))
(should (= 12 (if-let* ((a 3) (b (* 3 a))) (+ a b) (- a b)))))
#+END_SRC

Later I wrote [[needs]] which is more general than =when-let=, and can replace it.

** Common Lisp
CL code is the same:
#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro when-let (vars &rest body)
  "when with let using standard let-notation"
  (if (caar vars)
  `(let ((,(caar vars) ,(cadar vars)))
     ,(if (cdr vars)
	  `(when ,(caar vars)
	     ,(macroexpand-1 `(when-let ,(cdr vars) ,@body)))
	(append `(when ,(caar vars)) body)))
  (if (cdr vars)
      `(when ,(cadar vars)
	     ,(macroexpand-1 `(when-let ,(cdr vars) ,@body)))
    (append `(when ,(cadar vars)) body))))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/tests.lisp
(deftest when-let
    (when-let ((x (identity :ok)))
      (setf x (cons x x))
      x)
  (:ok . :ok))
#+END_SRC

BTW [[https://stackoverflow.com/questions/5902847/how-do-i-apply-or-to-a-list-in-elisp/34946813#34946813][some people use]] ~eval~ instead of ~macroexpand-1~:
#+BEGIN_SRC lisp
(defun apply-macro (macro arg-list)
  (eval
   `(,macro ,@(loop for arg in arg-list collect `(quote ,arg)))))
#+END_SRC
Usage examples:
#+BEGIN_SRC lisp
(apply-macro 'and '(1 2 3))
(apply-macro 'and '(1 nil 3))
#+END_SRC

* if-let
** Emacs Lisp
Similarly to [[when-let]], (in latest emacs) =if-let= is defined in ~subr-x.el~.

Like =when-let=, macro =sif-let= is heavily used in my projects.
It is somewhat similar to =when-let=, but offers "else" clause:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro sif-let (vars ifyes &rest body)
  "if with let using standard let-notation"
  (let ((if-true (s-gensym "it")) (result (s-gensym "r")))
    `(let (,if-true ,result)
       (when-let* ,vars
		 (setf ,if-true t
		  ,result ,ifyes))
       (if ,if-true
	   ,result
	 ,@body))))
#+END_SRC

Usage example:
#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 
  '(sif-let ((x 1) (y (1+ x)))
     (+ x y) (- x y) (* x y))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let (it17 r18) (when-let ((x 1) (y (1+ x))) (setf it17 t r18 (+ x y))) (if it17 r18 (- x y) (* x y)))
:END:

** Common Lisp
My =if-let= has almost the same functionality, as [[https://common-lisp.net/project/alexandria/draft/alexandria.html][alexandria:if-let]]
except that instead of single =else-form= there can be multiple forms.

#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro if-let (vars ifyes &rest body)
  "if with let using standard let-notation"
  (let ((if-true (gensym "it")) (result (gensym "r")))
    `(let (,if-true ,result)
       (when-let ,vars
		 (setf ,if-true t
		       ,result ,ifyes))
       (iff ,if-true ,result ,@body))))
#+END_SRC

Usage example:
#+BEGIN_SRC lisp :results drawer
(macroexpand-1 
  '(if-let ((x 1) (y (1+ x)))
     (+ x y) (- x y) (* x y)))
#+END_SRC

#+RESULTS:
:RESULTS:
(LET (#:|it597| #:|r598|)
  (WHEN-LET ((X 1) (Y (1+ X)))
    (SETF #:|it597| T
          #:|r598| (+ X Y)))
  (IFF #:|it597| #:|r598| (- X Y) (* X Y)))
:END:

Sometimes I need slightly changed versions of =if-let=:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro ifn-let (vars ifno &rest body)
  `(if-let ,vars
      (progn ,@body)
      ,ifno))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 '(ifn-let ((x (+ 1 2))) (+ 3 4) (+ 6 5) (+ 7 9))))
#+END_SRC

#+RESULTS:
:RESULTS:
(if-let ((x (+ 1 2))) (progn (+ 6 5) (+ 7 9)) (+ 3 4))
:END:

#+BEGIN_SRC emacs-lisp
(if-let ((x (+ 1 2))) (progn (+ 6 5) (+ 7 9)) (+ 3 4))
(if-let ((x (+ 1 2))) 1 2)
(if-let ((x t)) 1 2)
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro ifn-let (vars ifno &rest body)
  `(if-let ,vars
      (progn ,@body)
      ,ifno))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/tests.lisp
(deftest if-let
    (if-let ((x (identity :ok)))
            x
            :bad)
  :ok)
(deftest ifn-let
    (ifn-let ((x (identity :ok)))
            :bad
x )
  :ok)
#+END_SRC

