generated/tests.el

(ert-deftest needs()
(should(string= "(let ((a (identity 1))) (when a (1+ a)))" (format "%s" (macroexpand-1 `(needs((a (identity 1))) (1+ a))))))
(should(string= "(let ((a (identity 1))) (if a (progn (1+ a)) (alarm)))" (format "%s" (macroexpand-1 `(needs((a (identity 1) (alarm))) (1+ a))))))
(should(= 2 (needs((a (identity 1) 100)) 2)))
(should(= 200 (needs((a (identity 1) 100) (b (identity nil) 200) (c (+ a 1) 300)) 55))))
