shalaev.org
*** for using in Makefiles
My [[https://github.com/chalaev/backup2l.conf][backup]] system does not save files having the group ~tmp~.
I use this group to mark all generated (tangled) files:
#+BEGIN_SRC emacs-lisp :tangle generated/make.el :shebang ";; -*-  lexical-binding: t; -*-"
(require 'shalaev) ; ← needed for perms-from-str unless you have loaded it in another way
(defun after-tangle()
  "mark tangled files as non-backupable (chgrp tmp files) and non-excecutable"
  (let ((FN (buffer-file-name)))
#+END_SRC
The following line is equivalent to =chmod a-x FN=:
#+BEGIN_SRC emacs-lisp :tangle generated/make.el
    (set-file-modes FN (logand #o666 (perms-from-str (nth 8 (file-attributes FN 'string)))))
    (chgrp "tmp" FN)))
(add-hook 'org-babel-post-tangle-hook #'after-tangle)
#+END_SRC
so they are not backuped.
(Another way to set tangled files' permission is by [[https://orgmode.org/manual/Extracting-Source-Code.html#Header-arguments][updating]] the corresponding =BEGIN_SRC= line.)

My literate programming relies on emacs org mode and its =M-x org-babel-tangle= command, which I want to output the names of the generated files.
So in [[file:Makefile][Makefiles]] I often use ~printangle~ [it returns the list of exported (tangled) files]:
#+BEGIN_SRC emacs-lisp :tangle generated/make.el
;;(require 'org-babel)
(defun printangle(FN)
  "to be used in Makefile instead of org-babel-tangle-file"
  (let ((l (length default-directory)))
    (apply #'concat (mapcar #'(lambda(x) (substring (format "%s " x) l)) (org-babel-tangle-file FN)))))
#+END_SRC
← my [[https://github.com/chalaev/cl-simple-logger/blob/master/Makefile][Makefile]]s load its definition from [[file:helpers/derive-version.el][derive-version.el]].

*** Auto-updating certain blocks on save
Sometimes part of the code is automatically generated by emacs (e.g., from a table).
The following block regenerates such pieces of code before every save:
#+BEGIN_SRC emacs-lisp :tangle generated/make.el
(defvar eval-on-save nil "list of block names to be updated")
(defun eval-on-save (&rest var-names)
(let((BN(buffer-name)))
(when(and
(string= "org" (file-name-extension BN))
(not(member BN (mapcar #'car eval-on-save))))
(push(cons BN var-names) eval-on-save))))

(add-hook 'before-save-hook
(lambda()(save-excursion(let((BN(buffer-name)))
 (dolist(ES eval-on-save)
(when(string= BN (car ES)) ;; (clog :debug "'before-save-hook doing nothing cause %s is not an .org buffer" BN)
(clog :debug "activating before-save-hook for %s" BN)
 (dolist(block-name (cdr ES))
  (if(org-babel-goto-named-src-block block-name) (clog :error "could not find %s in %s" block-name BN)
    (org-babel-execute-src-block)))))))))
#+END_SRC
← provided that corresponding block names are contained in the =eval-on-save= variable, see [[https://github.com/chalaev/cloud/blob/master/cloud.org][cloud.org]] for an example.

=push-new= is used in my =cloud= project:
#+BEGIN_SRC emacs-lisp :tangle generated/make.el
(defmacro push-new(where &rest what)
  "allows many arguments"
`(progn ,@(mapcar #'(lambda(w) `(cl-pushnew ,w ,where :test #'string=)) what)))
#+END_SRC

*** Other stuff
(found online) =run-init-block=  runs ~init~ code block when loading an org-file:
#+BEGIN_SRC emacs-lisp :tangle generated/make.el
(defun run-init-block ()
"runs code block labeled 'init' when an org-file is opened in emacs"
  (org-babel-goto-named-src-block "init")
  (org-babel-execute-src-block))
#+END_SRC

** replacing cl-lib.el
This section will probably be archived because
=cl-lib= is used by so many packages so it is probably impossible to avoid it.

*** s-gensym
#+BEGIN_SRC emacs-lisp :tangle generated/cl.el :shebang ";; -*-  lexical-binding: t; -*-"
(let ((counter 0))
  (defun s-gensym(&optional starts-with)
    "similar to gensym in Common Lisp"
    (unless starts-with (setf starts-with "gs"))
    (let(sym)
      (while (progn
               (setf sym (make-symbol (concat starts-with (number-to-string counter))))
               (or (special-form-p sym) (functionp sym) (macrop sym) (boundp sym)))
        (s-incf counter))
      (s-incf counter)
      sym)))
#+END_SRC
=s-gensym= is used in macros, e.g.
#+BEGIN_SRC emacs-lisp :results drawer
(let ((ms (s-gensym "a")))
  `(let ((,ms 0))
     (1+ ,ms)))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((a3 0)) (1+ a3))
:END:

*** s-find
~s-find~ stands for "shalaev-find"; note that it is *not* compatible with ~find~ from ~cl.el~:
#+BEGIN_SRC emacs-lisp :tangle generated/cl.el
(defun s-find(item seq &optional key test)
  (let ((CS(car seq)) found (test (or test 
(cond
  ((stringp item) #'string=)
  ((numberp item) #'=)
  (t #'eq)))))
  (while
     (and
       (not (setf found (funcall test item (if key (funcall key CS) CS))))
       (setf seq (cdr seq)))
     (setf CS(car seq)))
     (when found CS)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest s-find.1()
  (should (equal '(3 4) (s-find 4 '((1 2) (3 4) (5 6)) #'cadr)))
  (should (= 3 (s-find 3 '(1 2 3 4 5))))
(let ((cumbersome-list '(141 142 143 144)))
  (should (= (s-find (* 12 12) cumbersome-list nil #'=) 144))
  (should (= (s-find (/ 144 2) cumbersome-list nil #'(lambda(x y) (= (* 2 x) y))) 144))
  (should (= (s-find 12 cumbersome-list nil #'(lambda(x y) (= (* x x) y))) 144)))
(let ((cumbersome-list '((141 142) (143 144))))
  (should (equal (s-find 12 cumbersome-list #'cadr #'(lambda(x y) (= y (* x x)))) '(143 144)))))
(ert-deftest s-find.2()
"this code comes from cloud project"
(let((plain(lambda(FR)(aref FR 0))) (cipher(lambda(FR)(aref FR 6)))
    (file-DB(list
  ["/home/user/proj/chat/chat.org" "shalaev" "shalaev" (24559 50916 0 0) 48756 420 "U3j"]
  ["~/proj/lisp-goodies/shalaev.org" "shalaev" "shalaev" (24552 57834 0 0) 432 61533 "Q8T"])))
(should(string= "/home/user/proj/chat/chat.org"   (funcall plain (s-find "U3j" file-DB cipher #'string=))))
(should(string= "~/proj/lisp-goodies/shalaev.org" (funcall plain (s-find "Q8T" file-DB cipher #'string=))))))
#+END_SRC

Note the difference from ~find~ defined in ~cl.el~: instead of
#+BEGIN_SRC emacs-lisp
(let ((cumbersome-list '((141 142) (143 144) (145 146))))
  (find 12 cumbersome-list :key #'cadr :test #'(lambda(x y) (= y (* x x)))))
#+END_SRC
we write
#+BEGIN_SRC emacs-lisp
(let ((cumbersome-list '((141 142) (143 144) (145 146))))
  (s-find 12 cumbersome-list #'cadr #'(lambda(x y) (= y (* x x)))))
#+END_SRC

*** s-decf and s-incf
#+BEGIN_SRC emacs-lisp
(defmacro s-decf (var &optional amount)
  (unless amount (setf amount 1))
  `(setf ,var (- ,var ,amount)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/cl.el
(defmacro s-incf (var &optional amount)
  (unless amount (setf amount 1))
  `(setf ,var (+ ,var ,amount)))
#+END_SRC

*** lett (replacing flet + let)
#+BEGIN_SRC emacs-lisp :tangle generated/cl.el
(defmacro lett(var-defs &rest body)
"let where one can define (usual) local variables as well as local functions"
  (if(car var-defs)
      (let((ME (macroexpand-1 `(lett ,(cdr var-defs) ,@body))))
      (if(and(listp (car var-defs))(eql 'defun (caar var-defs)))
	  (let((func-data (cdar var-defs)))
	    `(let((,(car func-data) (lambda ,(cadr func-data) ,@(cddr func-data))))
	        ,ME))
	`(let(,(car var-defs)) ,ME)))
    `(progn ,@body)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest lett()
(should(eval(let((fName(s-gensym)))
`(lett(z (a 2) (defun ,fName(x)(1+ x)) w)
 (functionp ,fName)))))

(should(not(let((fName(s-gensym)))
(functionp fName))))

(let((fName(s-gensym)))
(should(not(or (special-form-p fName) (functionp fName) (macrop fName) (boundp fName)))))

(should (= 6 (lett(z (a 2) (defun sw(x)(1+ x)) w)
  (unless (or z w)
    (setf z (funcall sw a))
    (* z a))))))
#+END_SRC

Warning: one has to use =funcall= with the functions defined in the =lett= header, e.g.
#+BEGIN_SRC emacs-lisp
(lett(z (a 2) (defun mf(x)(1+ x)))
     (setf z (funcall mf a))
     z)
#+END_SRC

#+RESULTS:
: 3

*** select, without, and drop
#+BEGIN_SRC emacs-lisp :tangle generated/local-packages.el
(defun select (from-where match-test)
  "select items matching the test"
    (let (collected wasted)
       (dolist (list-item from-where)
	 (if (funcall match-test list-item)
	   (push list-item collected)
	   (push list-item wasted)))
(cons (reverse collected) (reverse wasted))))
(defun CPU-cores()
  "return number of CPU cores in linux"
  (length(car(select(process-lines "cat" "/proc/cpuinfo")
      (lambda(str) (string-match "processor[[:blank:]]+:[[:blank:]]+[[:digit:]]+$" str))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest select()
(let ((test-list  '(4 22 11 33 12 24 77)))
  (should (not (car (select test-list #'zerop))))
  (should (equal '(11 33 77) (car (select test-list #'cl-oddp))))
  (should (equal '(4 22 12 24) (car (select test-list #'cl-evenp))))))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/files.lisp
(defun without(source wrong-items &key (key #'identity) (test #'eql))
  "returns (copy of) source without wrong-items"
  (let((WI(if(listp wrong-items) wrong-items (list wrong-items))))
    (remove-if #'(lambda(x) (find (funcall key x) WI :test test)) source)))
(define-modify-macro drop(place &rest what) without)
#+END_SRC

#+RESULTS:
: DROP

#+BEGIN_SRC lisp :results drawer
(macroexpand `(drop ll 2 4))
#+END_SRC

#+RESULTS:
:RESULTS:
(SETQ LL (WITHOUT LL 2 4))
T
:END:

#+BEGIN_SRC lisp
(define-modify-macro filter-list (ll fun)
  (lambda(ll fun) (remove-if-not fun ll)))
#+END_SRC

#+RESULTS:
: FILTER-LIST

#+BEGIN_SRC lisp :tangle generated/tests.lisp
(deftest without.1
(let((ll '(1 2 3 4)))
  (without ll 2))
(1 3 4))
(deftest drop.1
(let((ll '(1 2 3 4)))
  (drop ll '(2 4))
  ll)
(1 3))
(deftest without.2
(let((ll '((1 2) (3 4 5) (6 7 8 9))))
  (without ll '(2 3 7) :key #'cadr))
((3 4 5)))
(deftest drop.2
(let((ll '((1 2) (3 4 5) (6 7 8 9))))
  (drop ll '(2 3 7) :key #'cadr)
ll)
((3 4 5)))
#+END_SRC


#+BEGIN_SRC emacs-lisp :tangle generated/functions.el :shebang ";; -*-  lexical-binding: t; -*-"
(defun without(source &rest wrong-items)
  "returns (copy of) source without wrong-items"
  (car (select source #'(lambda(x) (not (member x wrong-items))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest without()
(let ((test-list  '(4 22 11 33 12 24 77)))
  (should (equal '(4 22 11 33 77) (without test-list 12 24)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro drop (from-where &rest what)
`(setf ,from-where (without ,from-where ,@what)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest drop()
(let ((test-list  '(4 22 11 33 12 24 77)))
  (drop test-list 12 24)
  (should (equal '(4 22 11 33 77) test-list))))
#+END_SRC

*** to do
reduce, …

** short pieces of code
