generated/tests.el

(ert-deftest s-find.1()
  (should (equal '(3 4) (s-find 4 '((1 2) (3 4) (5 6)) #'cadr)))
  (should (= 3 (s-find 3 '(1 2 3 4 5))))
(let ((cumbersome-list '(141 142 143 144)))
  (should (= (s-find (* 12 12) cumbersome-list nil #'=) 144))
  (should (= (s-find (/ 144 2) cumbersome-list nil #'(lambda(x y) (= (* 2 x) y))) 144))
  (should (= (s-find 12 cumbersome-list nil #'(lambda(x y) (= (* x x) y))) 144)))
(let ((cumbersome-list '((141 142) (143 144))))
  (should (equal (s-find 12 cumbersome-list #'cadr #'(lambda(x y) (= y (* x x)))) '(143 144)))))
(ert-deftest s-find.2()
"this code comes from cloud project"
(let((plain(lambda(FR)(aref FR 0))) (cipher(lambda(FR)(aref FR 6)))
    (file-DB(list
  ["/home/user/proj/chat/chat.org" "shalaev" "shalaev" (24559 50916 0 0) 48756 420 "U3j"]
  ["~/proj/lisp-goodies/shalaev.org" "shalaev" "shalaev" (24552 57834 0 0) 432 61533 "Q8T"])))
(should(string= "/home/user/proj/chat/chat.org"   (funcall plain (s-find "U3j" file-DB cipher #'string=))))
(should(string= "~/proj/lisp-goodies/shalaev.org" (funcall plain (s-find "Q8T" file-DB cipher #'string=))))))

(ert-deftest lett()
(should(eval(let((fName(s-gensym)))
`(lett(z (a 2) (defun ,fName(x)(1+ x)) w)
 (functionp ,fName)))))

(should(not(let((fName(s-gensym)))
(functionp fName))))

(let((fName(s-gensym)))
(should(not(or (special-form-p fName) (functionp fName) (macrop fName) (boundp fName)))))

(should (= 6 (lett(z (a 2) (defun sw(x)(1+ x)) w)
  (unless (or z w)
    (setf z (funcall sw a))
    (* z a))))))

(ert-deftest select()
(let ((test-list  '(4 22 11 33 12 24 77)))
  (should (not (car (select test-list #'zerop))))
  (should (equal '(11 33 77) (car (select test-list #'cl-oddp))))
  (should (equal '(4 22 12 24) (car (select test-list #'cl-evenp))))))

(ert-deftest without()
(let ((test-list  '(4 22 11 33 12 24 77)))
  (should (equal '(4 22 11 33 77) (without test-list 12 24)))))

(ert-deftest drop()
(let ((test-list  '(4 22 11 33 12 24 77)))
  (drop test-list 12 24)
  (should (equal '(4 22 11 33 77) test-list))))
