generated/tests.el

(ert-deftest perms-from-str()
  (should (= 432 (perms-from-str "-rw-rw----"))))

(ert-deftest perms-to-str()
  (should (string= "rw-rw-rwx" (perms-to-str #o667))))
