shalaev.org
*** time<
In =time<= I have to add 3 seconds of time to avoid chatter effects:
if at some moment the files are synchronized between the host and the cloud,
this situation might change due to time-desynchronization.
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun time< (t1 t2)
  (and
    (time-less-p (time-add t1 3) t2)
    (not (time-less-p (time-add t2 3) t1))))
#+END_SRC
This problem demonstrates the importance of the time synchronization (via =ntpdate= or an =ntp= server).

*** parsing time and date
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun parse-date (str)
  (mapcar 'string-to-number
	  (cond
 ((string-match "\\([0-9]\\{4\\}\\)[/-]\\([0-9][0-9]\\)[/-]\\([0-9][0-9]\\)" str) (mapcar #'(lambda (x) (match-string x str)) '(3 2 1)))
 ((string-match "\\([0-9][0-9]\\)[/-]\\([0-9][0-9]\\)[/-]\\([0-9]\\{4\\}\\)" str) (mapcar #'(lambda (x) (match-string x str)) '(2 1 3)))
 ((string-match "\\([0-9][0-9]\\)\\.\\([0-9][0-9]\\)\\.\\([0-9]\\{4\\}\\)" str) (mapcar #'(lambda (x) (match-string x str)) '(1 2 3)))
 ((string-match "\\([0-9][0-9]\\)/\\([0-9][0-9]\\)/\\([0-9]\\{2\\}\\)" str) (mapcar #'(lambda (x) (match-string x str)) '(2 1 3)))
 ((string-match "\\([0-9]\\{2\\}\\)[/-]\\([0-9][0-9]\\)" str) (append (mapcar #'(lambda (x) (match-string x str)) '(2 1)) (list (format-time-string "%Y" (current-time)))))
 (t (clog :error "date format not recognized in %s" str) nil))))
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun parse-only-time (str)
  (firstN (parse-time-string str) 3))
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun parse-date-time(str)
  (if (string-match "[0-9]\\{4\\}-[0-9][0-9]-[0-9][0-9] [0-9][0-9]:[0-9][0-9]" str)
      (parse-time-string str)
    (let ((SS (split-string str)))
      (append (parse-only-time (cadr SS))
	      (parse-date (car SS))))))
#+END_SRC
Example:
#+BEGIN_SRC emacs-lisp :results drawer
(cons (parse-only-time "16:09:37")
(mapcar #'(lambda(x) (format-time-string "%F %H:%M:%S %Z" (apply #'encode-time (parse-date-time x))))
 (list "10/21 14:54"
        "2020-10-10 14:54:40  EDT")))
#+END_SRC

#+RESULTS:
:RESULTS:
((37 9 16) 2020-10-21 14:54:00 EDT 2020-10-10 14:54:40 EDT)
:END:

* configuration files
Instead of storing configuration in =.el= files (e.g., =~/.emacs=), I prefer to store it in a separate file.
This is because
1. sometimes the code will update its configuration, and
2. in this way configuration data is more separated from other ~elisp~ programs.

** read-conf-file
#+BEGIN_SRC emacs-lisp :tangle generated/conf.el :shebang ";; -*-  lexical-binding: t; -*-"
(defmacro while-let(var-defs while-cond &rest body)
  `(let* (,@var-defs)
     (while ,while-cond
       ,@body)))
#+END_SRC

Note: only Latin characters are allowed in config files
#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
(defun read-conf-file(FN &optional max-size)
  "reads configuration file"
  (error-in "read-conf-file"
(with-temp-buffer(insert-file-contents (untilde FN))
(setf buffer-read-only t)
(let(res)					      
  (dolist(str(split-string (buffer-string) "\n"))
    ;; (clog :debug "str= %s" str)
	    (unless(or
(string= "
" str)
(= ?# (string-to-char str))); ignoring comments or empty lines
(if(string-match "^\\(\\ca+\\)=\\([[:print:]]+\\)$" str)
	  (let((key(intern(match-string 1 str))) (val(match-string 2 str)))
	    (if(assoc key res)
		(setcdr (assoc key res) val)
	      (push (cons key val) res)))
(unless(string= "" str)
	(clog :warning "invalid string in %s: %s" FN str)))))
(reverse res)))))
#+END_SRC

Minimal Common Lisp configuration file reader (only for strings and integers):
#+BEGIN_SRC lisp :tangle generated/conf.lisp
(defun read-conf-file(FN)
  "reads configuration file"
(when(probe-file FN) (delete nil
(with-open-file (in FN)
    (loop for str = (read-line in nil nil) while str
	with matches collect
(case-f (lambda(regexp) (nth-value 1 (cl-ppcre:scan-to-strings regexp str))) matches; for now we scan for integer numbers only
("^(\\p{Script:Latin}+)\\s*=\\s*(\\d+)\\s*$" ; does not allow numbers in the property name
  (cons (aref matches 0) (parse-integer(aref matches 1))))
("^(\\p{Script:Latin}+)\\s*=\\s*([^\\s]+)\\s*$"
  (cons (aref matches 0) (aref matches 1)))
(otherwise (warn "unrecognized line: ~s" str))))))))
#+END_SRC
← I am creating special package for that because of extra dependences
=:cl-ppcre= and =:cl-ppcre-unicode=

08/02 Let me save in the same file functions for encoding and decoding numbers to/from strings:
#+BEGIN_SRC lisp :tangle generated/conf.lisp
(let((all-chars "0123456789abcdefghijklmnopqrstuvwxyz") (EC "ABCDEFGHIJKLMNOPQRSTUVWXYZ"))
(defun rand-str(&optional (N 8) (extraChars EC))
"random string of N characters"
(declare (type integer N) (type string extraChars))
(let((AC(concatenate 'string all-chars extraChars)))
  (apply #'concatenate (cons 'string
    (loop repeat N collect (string (elt AC (random (length AC)))))))))
(defun intToChar(intNumer &optional (extraChars EC))
"encodes integer into string"
(declare (type integer intNumer) (type string extraChars))
(let*((AC(concatenate 'string all-chars extraChars))
      (lad(length AC)) divmod)
(declare (type integer lad))
    (loop do
	 (setf divmod (multiple-value-call #'list (floor intNumer lad))
	       intNumer (car divmod))
       collecting (char AC (cadr divmod)) into res
       while (> intNumer 0)
       finally (return (concatenate 'string (reverse res))))))
(defun charToInt(str &optional (extraChars EC))
"decodes string encoded by intToChar"
(declare (type string str extraChars))
(let*((AC(concatenate 'string all-chars extraChars))
      (lad(length AC)) (res 0) (base 1))
(declare (type integer lad res base))
	(dolist (c (concatenate 'list (reverse str)))
	  (incf res (* base (position c AC)))
	  (setf base (* base lad)))
	res)))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/tests.lisp
(deftest intToChar
(charToInt(intToChar 123456789))
123456789)
#+END_SRC

** parse-conf
#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
(defun parse-parameter(str &optional par-type)
"for =parse-conf=: optionally parses first (string) argument into the specified type"
  (when str
    (cond
     ((eql par-type 'integer) (string-to-number str))
#+END_SRC
← =integer= is the only recognized type as of 02/23; we might need more special type treatment here.
#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
     ((consp par-type) (mapcar #'(lambda(s)(parse-parameter s (car par-type))) (split-string str)))
     (t str))))
#+END_SRC
← e.g., =(parse-parameter "a b f qwfe weq" '(string))= ⇒ =("a" "b" "f" "qwfe" "weq")=.

#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
(defun typeof(v)
"when v is a keyword, returns corresp. symbol; otherwise returns v's type"
  (if(consp v) (if(eql(car v) 'quote) (typeof(cadr v))  (list(typeof(car v))))
    (cond
     ((keywordp v) (intern(substring(symbol-name v)1)))
     (t(type-of v)))))
#+END_SRC
← e.g., =(typeof '("1" "2"))= ⇒ =(string)=, and =(typeof :integer)= ⇒ =integer=.

#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
(defun KP(x)(if(listp x)(KP(car x))(keywordp x)))
(defun typeof-expr(expr)
  (cond
   ((listp expr) (when-let((TO(typeof-expr(car expr)))) (list TO)))
   ((consp expr) nil)
   (t (let((TO(typeof expr)))
	(unless(eql TO 'symbol) TO)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest typeof-expr()
(should(eql 'integer (typeof-expr 1)))
(should(equal '(integer) (typeof-expr '(1 2))))
(should(eql 'string (typeof-expr "abc")))
(should(equal '(string) (typeof-expr '("abc" "def"))))
(should(not(typeof-expr '(incf z)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
(defmacro parse-conf(conf-expr vars)
"for =let-conf=: produces configuration (list of conses) updates variables =vars= conf-expr"
  (let((conf(s-gensym "conf")))
    `(let((,conf ,conf-expr))
(list ,@(mapcar
    #'(lambda(CV)
	(if(listp CV)
	    (if(cddr CV)
#+END_SRC
if =(length CV)= ⇒ 3:
#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
(let((TO(typeof(car CV))))
  `(cons (quote ,(cadr CV))
	 ,(if-let((cCV(caddr CV)))
	      `(or(parse-parameter(cdr(assoc (quote ,(cadr CV)) ,conf)) (quote ,TO)) ,cCV)
	    `(parse-parameter(cdr(assoc (quote ,(cadr CV)) ,conf)) (quote ,TO)))))
#+END_SRC
if =(length CV)= ⇒ 2, type =TO= is either specified explicitly (when =(KP(car CV))= ⇒ t), or is determined from the default value:
#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
(let((TO(typeof-expr(car(if(KP(car CV)) CV (cdr CV)))))
     (varName(if(KP(car CV)) (cadr CV) (car CV)))
     (default(unless(KP(car CV))(cadr CV))))
  `(cons (quote ,varName)
	 ,(if default
	      `(or(parse-parameter(cdr(assoc (quote ,varName) ,conf)) (quote ,TO)) ,default)
	    `(parse-parameter(cdr(assoc (quote ,varName) ,conf)) (quote ,TO))))))
#+END_SRC
if =(listp CV)= ⇒ nil:
#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
`(cons (quote ,CV) (parse-parameter(cdr(assoc (quote ,CV) ,conf))))))
	 vars)))))
#+END_SRC
Usage examples:
1. simplest case: =(parse-conf cc (a b))= ⇒ (expands to)
   =(let((conf14 cc))=
     =(list (cons (quote a) (parse-parameter (cdr (assoc (quote a) conf14))))=
           =(cons (quote b) (parse-parameter (cdr (assoc (quote b) conf14))))))=
2. specifying value type =(parse-conf cc ((:integer a) ((:integer) b)))= is useful when no default value supplied ⇒
   =(let((conf17 cc))=
     =(list=
      =(cons (quote a) (parse-parameter (cdr (assoc (quote a) conf17)) (quote integer)))=
      =(cons (quote b) (parse-parameter (cdr (assoc (quote b) conf17)) (quote (integer))))))=
3. specifying default values (used unless contained in =cc=): =(parse-conf cc ((a 1) (c 3)))=  ⇒
   allows to supply type to =parse-parameter=:
   =(let((conf20 cc))=
     =(list=
      =(cons (quote a) (or (parse-parameter (cdr (assoc (quote a) conf20)) (quote integer)) 1))=
      =(cons (quote c) (or (parse-parameter (cdr (assoc (quote c) conf20)) (quote integer)) 3))))=
4. sometimes, when default value is a variable, both type and default value must be specified:
   =(parse-conf cc ((:integer abc xy)))= ⇒
   =(let((conf21 cc))=
      =(list=
       =(cons (quote abc) (or (parse-parameter (cdr (assoc (quote abc) conf21)) (quote integer)) xy))))=

