generated/tests.el

(ert-deftest typeof-expr()
(should(eql 'integer (typeof-expr 1)))
(should(equal '(integer) (typeof-expr '(1 2))))
(should(eql 'string (typeof-expr "abc")))
(should(equal '(string) (typeof-expr '("abc" "def"))))
(should(not(typeof-expr '(incf z)))))
