shalaev.org
** let-conf
=let-conf= declares local variables in the usual =let= manner with optional default values (see [[parse-conf]] examples above).
The values are updated from configuration (list of conses) produced by ~conf-expr~ form.
#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
(defmacro let-conf(configuration vars &rest body)
  `(let((,(car configuration) (parse-conf ,(cdr configuration) ,vars)))
,@body))
#+END_SRC
where only the configuration parameters mentioned in =vars= argument will be considered.

#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
(defmacro let-conf-c(CName variable-name)
"for let-conf"
 `(cdr(assoc(quote ,variable-name) ,CName)))
#+END_SRC
←  I would probably use =macrolet= inside =letc= for =let-conf-c= but prefer to avoid using =cl.el=.

Usage example (see, e.g., [[https://github.com/chalaev/el-backup/blob/master/backup.org][el-backup project]]):
#+BEGIN_SRC emacs-lisp :results drawer
(let-conf(conf . (read-conf-file (concat *config-directory* "el-backup.conf")))
  ((black-groups ("tmp")))
  (let-conf-c black-groups))
#+END_SRC

#+RESULTS:
:RESULTS:
(tmp)
:END:

In case we want to define variables locally:
#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
(defmacro letc(conf-data vars &rest body)
(let((conf-var(s-gensym)))
  `(let((,conf-var (parse-conf ,conf-data ,vars)))
(let(,@(mapcar (lambda(v)
(let((VN(ifn(listp v)v(if(KP(car v))(cadr v)(car v)))))
`(,VN (let-conf-c ,conf-var ,VN))))
vars))
,@body))))
#+END_SRC

Sometimes for testing we need to change local variables in the least possible intrusive way.
We do it as follows: main code contains a specially marked comment like this one:
#+BEGIN_SRC emacs-lisp
;;test>;; (some-code)
#+END_SRC
← [[file:Makefile][Makefile]] will remove these lines from the [[file:packaged/cloud.el][packaged code]], and uncomment them in the [[file:tests/cloud.el][testing version]].


#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
(defmacro setc(FN vars &rest body)
`(letc(read-conf-file ,FN) ,vars ,@body))
#+END_SRC

** write-conf
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun together(strings)
"concatenates list of strings"
(if strings
  (mapconcat 'identity strings " ")
  ""))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
(defun print-variable(var)
(cond
((stringp var) var)
((integerp var) (format "%d" var))
((listp var) (together(mapcar #'print-variable var)))
(t
(clog :error "type of %s is undefined" var)
 "N/A")))
(defun write-conf(FN conf)
  (with-temp-file FN
(dolist(conf-item conf)
(insert(format "%s=%s
" (car conf-item)
(if(cdr conf-item) (print-variable (cdr conf-item)) "")))))
 t)
#+END_SRC
We can prepare list if conses for =write-conf= using the following =make-conf= macro:
#+BEGIN_SRC emacs-lisp :tangle generated/conf.el
(defmacro make-conf(&rest variable-names)
  `(list
    ,@(mapcar (lambda(VN) `(cons (quote ,VN) ,VN)) variable-names)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results drawer
(macroexpand-1 (make-conf ~ *emacs-d*))
#+END_SRC

#+RESULTS:
:RESULTS:
((~ . /home/shalaev/) (emacs-d . ~/.emacs.d/))
:END:

* file/directory fuctions
** Common Lisp
#+BEGIN_SRC lisp :tangle
(defun FN-as-directory(FN)
  (let((PN(pathname FN)))
    (if-let((PPN(pathname-name PN)))
	(merge-pathnames
	 (make-pathname :directory `(:relative ,PPN))
	 (make-pathname :directory (pathname-directory PN)))
	PN)))
#+END_SRC
← use =uiop:ensure-directory-pathname= instead.

** ELisp
*** chgrp
#+BEGIN_SRC emacs-lisp :tangle generated/file-functions.el
(defun chgrp(group file-name)
  (= 0 (call-process "chgrp" nil nil nil group (untilde file-name))))
#+END_SRC
See also =dired-do-chown=.

*** get-file-properties
This code moved here 12/28 from the [[https://github.com/chalaev/cloud][cloud project]].

BTW, =(file-exists-p FN)= produces ~nil~ if the file resides in directory with (rx) permissions →
#+BEGIN_SRC emacs-lisp :tangle generated/file-functions.el
(defun get-file-properties(FN)
  (when-let((FA (and (file-exists-p FN) (file-attributes FN 'string))))
      (cl-destructuring-bind
	  (uid gid acess-time mod-time status-time fsize ms void inode fsNum)
	  (cddr FA)
(vector FN uid gid mod-time fsize (perms-from-str ms)))))
#+END_SRC

It is important that the first 6 fields are ordered as follows:
#+NAME: fileFields
| field  | num ID | description                                                       |
|--------+--------+-------------------------------------------------------------------|
| plain  |      0 | original (local) file name                                        |
| uname  |      1 | user name                                                         |
| gname  |      2 | group name                                                        |
| mtime  |      3 | modification time                                                 |
| size   |      4 | file size (should not be saved)                                   |
| modes  |      5 | access permissions                                                |
#+TBLFM: $2=@#-2

*** ensure-dir-exists
#+BEGIN_SRC emacs-lisp :tangle generated/file-functions.el
(defun ensure-dir-exists (DN)
  (condition-case err
      (progn (make-directory DN t) DN)
    ;; (file-already-exists (clog :debug "%s already exists" DN))
    (file-error (clog :debug "cannot create %s" DN))))
#+END_SRC

*** FN, to-dir, and need-dir
#+BEGIN_SRC emacs-lisp :tangle generated/file-functions.el
(defun FN(FN0 &rest other-FN-parts)
"concatenates arguments into file name inside (sub)directory"
(if (car other-FN-parts)
    (apply #'FN
(cons 
  (concat (file-name-as-directory FN0) (car other-FN-parts))
  (cdr other-FN-parts)))
  FN0))
(defun to-dir(root &rest dirs)
(if (car dirs)
    (apply #'to-dir
(cons 
  (file-name-as-directory (concat (file-name-as-directory root) (car dirs)))
  (cdr dirs)))
  (file-name-as-directory root)))
(defun need-dir(&rest DNs)
  (ensure-dir-exists (untilde(apply #'to-dir DNs))))
(defvar *config-directory* (need-dir *emacs-d* "conf") "where config files for el-packages are stored")
#+END_SRC

*** cat-file
(See also =echo-to-file=.)
#+BEGIN_SRC emacs-lisp :tangle generated/file-functions.el
(defun cat-file(FN)
"converts file to string"
(with-temp-buffer
    (insert-file-contents FN)
    (buffer-string)))
#+END_SRC

* logging system
It is probably too small to be packaged.
** Short description
This code prints log messages to ~*Messages*~ buffer and saves them to log file =~/.emacs.d/elisp.log=.
Every message is formatted similarly to how it is done by =format= function.
** Code
Global variable =*log-level*= controls how much information should be logged: the (default) zero value means
that all types of log-messages (:debug :warning :info :error) should be logged (saved);
the value 3 means that only error messages (marked with :error) will be logged:
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el :shebang ";; -*-  lexical-binding: t; -*-"
(require 'cl-lib); (at least) for decf
(defvar *log-level* 0)
#+END_SRC
Log messages are accumulated in =*log-buffer*=
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(defvar *log-buffer* nil)
#+END_SRC
and once in a while (when the number of queued messages >30 or before quitting ~emacs~) appended to the file =~/.emacs.d/elisp.log=:
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(let((last-FLD "")); saves last day printed to the log file
(defun log-flush(&optional log-FN)
  "save log messages to file for debugging"
  (when (= 0 *log-level*)
    (with-temp-buffer
      (let ((today-str (format-time-string "%04Y-%02m-%02d" (current-time))))
	(unless (string= today-str last-FLD)
	  (setf last-FLD today-str)
	  (insert today-str) (newline))
	(dolist (msg (reverse *log-buffer*))
	  (insert msg) (newline)))
      (append-to-file (point-min) (point-max) (or log-FN (concat *emacs-d* "elisp.log"))))
    (setf *log-buffer* nil))))
#+END_SRC
The main logging function:
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(defun clog(level fstr &rest args)
  "simple logging function" ; level is one of → :debug :info :warning :error
(let ((log-push (lambda(msg)
  (push msg *log-buffer*)
  (when (< 30 (length *log-buffer*)) (log-flush)))))
#+END_SRC
Since we have [[https://www.emacswiki.org/emacs/EmacsLispLimitations][no multi-threading in elisp]], we do not need to introduce any lock functions.
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(when (<= *log-level* (or (pos level '(:debug :info :warning :error)) 0))
  (let ((log-msg
	   (cons
	    (concat "%s " (format-time-string "%H:%M:%S.%3N "
(apply 'encode-time (butlast (decode-time (current-time)) 3)))
		    fstr)
	    (cons (symbol-name level) args))))
      (funcall log-push (apply #'format log-msg))
      (apply #'message log-msg)))
 nil))
#+END_SRC
where I inserted =nil= at the end just for convenience, since I often use
=clog= for error messages:
#+BEGIN_SRC emacs-lisp
(if (we-got-problems)
(clog :error "we've got %d problems!" 1000)
(the-rest-of-code))
#+END_SRC
← in case of "problems" I want this code block to return =nil=.

Let us not forget to flush the log
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(defun on-emacs-exit()
  (clog :debug "flushing comments before quiting emacs")
  (log-flush))
#+END_SRC
before quitting emacs:
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(add-hook 'kill-emacs-hook 'on-emacs-exit)
#+END_SRC

For debugging purposes (to be used in modified =defun= instead of =clog= see my =defun= re-definition):
to be used in modified =defun= instead of =clog=:
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(defun space-log(N-of-spaces fstr)
  "prints spaces before log messages"
(let ((log-push (lambda(msg)
  (push msg *log-buffer*)
  (when (< 30 (length *log-buffer*)) (log-flush))))
(spaces ""))
(while(< 0 N-of-spaces)
 (cl-decf N-of-spaces)
 (setf spaces (concat " " spaces)))
(let((msg(concat spaces fstr)))
(funcall log-push msg)
(message msg)))
nil)
#+END_SRC

