generated/conf.el

(defmacro let-conf(configuration vars &rest body)
  `(let((,(car configuration) (parse-conf ,(cdr configuration) ,vars)))
,@body))

(defmacro let-conf-c(CName variable-name)
"for let-conf"
 `(cdr(assoc(quote ,variable-name) ,CName)))

(defmacro letc(conf-data vars &rest body)
(let((conf-var(s-gensym)))
  `(let((,conf-var (parse-conf ,conf-data ,vars)))
(let(,@(mapcar (lambda(v)
(let((VN(ifn(listp v)v(if(KP(car v))(cadr v)(car v)))))
`(,VN (let-conf-c ,conf-var ,VN))))
vars))
,@body))))

(defmacro setc(FN vars &rest body)
`(letc(read-conf-file ,FN) ,vars ,@body))

(defun print-variable(var)
(cond
((stringp var) var)
((integerp var) (format "%d" var))
((listp var) (together(mapcar #'print-variable var)))
(t
(clog :error "type of %s is undefined" var)
 "N/A")))
(defun write-conf(FN conf)
  (with-temp-file FN
(dolist(conf-item conf)
(insert(format "%s=%s
" (car conf-item)
(if(cdr conf-item) (print-variable (cdr conf-item)) "")))))
 t)

(defmacro make-conf(&rest variable-names)
  `(list
    ,@(mapcar (lambda(VN) `(cons (quote ,VN) ,VN)) variable-names)))
