shalaev.org
** load*
Preventing multiple load of the seame file:
#+BEGIN_SRC emacs-lisp :tangle generated/load.el :shebang ";; -*-  lexical-binding: t; -*-"
(defun barename (FN)
  (let ((SS (split-string (file-name-nondirectory FN)  "\\." t)))
    (mapconcat #'(lambda(x)x) (butlast SS) ".")))
#+END_SRC

The following function is designed to prevent multiple evaluation of one and the same file:
#+BEGIN_SRC emacs-lisp :tangle generated/load.el
(let (loaded); prevents duplicate evaluation of files
(defun load* (x &optional el-prefix)
  (let ((FN (tilde (file-chase-links (concat (or el-prefix "~/") x)))))
    (unless (member (car (last (split-string FN "\\." t))) '("el" "elc"))
      (setf FN (concat FN ".el")))
    (unless (member FN loaded) (load-file FN) (push (barename FN) loaded)))))
#+END_SRC

Usage example:
#+BEGIN_SRC emacs-lisp
(mapcar #'(lambda(x) (load* x "~/programming/"))
	'("macros" "functions" "logging"  ....))
#+END_SRC

* common lisp
** iff
#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro iff (test-form then &rest else)
  "elisp-kind of if"
  (if (cdr else)
      `(if ,test-form ,then (progn ,@else))
      (if (car else)
	  `(if ,test-form ,then ,@else)
	  `(when ,test-form ,then))))
#+END_SRC

#+BEGIN_SRC lisp :results drawer
(macroexpand-1 '(iff 1 2))
#+END_SRC

#+RESULTS:
:RESULTS:
(WHEN 1 2)
T
:END:

#+BEGIN_SRC lisp :results drawer
(macroexpand-1 '(iff 1 2 3))
#+END_SRC

#+RESULTS:
:RESULTS:
(IF 1
    2
    3)
T
:END:

#+BEGIN_SRC lisp :results drawer
(macroexpand-1 '(iff 1 2 3 4))
#+END_SRC

#+RESULTS:
:RESULTS:
(IF 1
    2
    (PROGN 3 4))
T
:END:

** simple stuff
#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro ifn (test ifnot &rest ifyes)
`(iff (not ,test) ,ifnot ,@ifyes))
#+END_SRC

01/18 tried to avoid strange effects in =hunchentoot= with its global variables
by using ~macroexpand-1~:
#+BEGIN_SRC lisp
(defmacro ifn (test ifnot &rest ifyes)
(macroexpand-1 `(iff (not ,test) ,ifnot ,@ifyes)))
#+END_SRC
but that did not help ☹.

So let us check if ~ifn~ works o.k. inside ~multiple-value-bind~:
#+BEGIN_SRC lisp :tangle generated/tests.lisp
(deftest ifn
(let(a)
(multiple-value-bind (x y) (floor 44 11)
  (ifn(= y 0)
      (list 1 x y)
(push 1 a)
(push 2 a)
a)))
(2 1))
#+END_SRC


#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro concat (&rest strs)
  `(concatenate 'string ,@strs))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/tests.lisp
(deftest concat
  (concat "/etc/" "dqoE.tmp")
"/etc/dqoE.tmp")
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro aset(arr pos val)
  `(setf (aref ,arr ,pos) ,val))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/tests.lisp
(deftest aset
(aref
(let ((container (make-array 5)))
  (aset container 2 23987)
  container)
2)
23987)
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro hset(arr pos val)
  `(setf (gethash ,pos ,arr) ,val))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/tests.lisp
(deftest hset
(gethash 'one-entry
(let ((container (make-hash-table)))
  (hset container 'one-entry 23987)
  container))
23987 t)
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro assoc-set (cons-list string-ID new-value)
  `(setf
   (cdr(assoc ,string-ID ,cons-list :test #'string=))
   ,new-value))
#+END_SRC

** file/directory fuctions
*** rmdir
#+BEGIN_SRC lisp :tangle generated/files.lisp
(defun rmdir(DN)
  (handler-case (cons t (sb-posix:rmdir DN))
    (sb-posix:syscall-error (c)
    (cons nil
      (case (sb-posix:syscall-errno c)
        (13 :permission)
        (2 :absent)
        (39 :occupied)
        (otherwise (cons :unknown (sb-posix:syscall-errno c))))))))
#+END_SRC
– expected to work on SBCL only.

*** echo-to-file
#+BEGIN_SRC lisp :tangle generated/files.lisp
(defun echo-to-file(FN str)
(handler-case 
(progn (with-open-file (stream FN
    :if-exists :append;  :overwrite
    :direction :output
    :if-does-not-exist :create)
(format stream "~a~%" str))
FN)
  (error () nil)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun echo-to-file(FN &optional str)
 (write-region (or str "") nil (untilde FN))
 (tilde FN))
(defmacro echo-to-files(FNs &optional str)
  `(dolist (FN ,FNs) (echo-to-file FN ,str)))
#+END_SRC

*** merge-paths = generalized merge-pathnames
#+BEGIN_SRC lisp :tangle generated/files.lisp
(defun merge-paths(root-dir &rest sub-dirs)
  (reduce
   #'(lambda(DN FN) (merge-pathnames FN (uiop:ensure-directory-pathname DN)))
   sub-dirs
   :initial-value root-dir))
#+END_SRC
* simple stuff
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro ifn (test ifnot &rest ifyes)
`(if (not ,test) ,ifnot ,@ifyes))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun firstN(lista N)
  "returning first N elments of the list"
  (when (and (< 0 N) (car lista))
    (cons (car lista) (firstN (cdr lista) (1- N)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(require 'cl-lib)
(defvar *good-chars*
(let ((forbidden-symbols '(?! ?@ ?# ?$ ?% ?& ?* ?\( ?\) ?+ ?= ?/ ?{ ?} ?\[ ?\] ?: ?\; ?< ?> ?_ ?- ?| ?, ?. ?` ?' ?~ ?^ ?\")))
    (append
     (cl-loop for i from ?A to ?Z unless (member i forbidden-symbols) collect i)
     (cl-loop for i from ?a to ?z unless (member i forbidden-symbols) collect i)
     (cl-loop for i from ?0 to ?9 unless (member i forbidden-symbols) collect i)))
"safe characters for file names: everything is forbidden except for what is allowed")
(defun rand-str(N)
  (apply #'concat
     (cl-loop repeat N collect (string (nth (random (length *good-chars*)) *good-chars*)))))
#+END_SRC

There is probably some standard function or macro doing this:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro end-push (what where)
"adds an item to the end of the list, resembles 'add-to-list'"
  `(if ,where (push ,what (cdr (last ,where)))
      (push ,what ,where)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest end-push()
(should (equal '(1)
(let (container)
  (end-push 1 container)
  container)))
(should (equal '(1 2)
(let (container)
  (end-push 1 container)
  (end-push 2 container)
  container))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun land(args)
"'and' for a list"
  (cl-reduce #'(lambda(x y) (and x y)) args :initial-value t))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest land()
  (should (land '(t t t t 1 2)))
  (should (not (land '(t t t nil 1 2)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun sforward-line()
"safe forward-line"
  (if (< (line-end-position) (point-max))
     (forward-line)
     (move-end-of-line 1)))
(defun read-line(&optional max-size)
"returns current string of a buffer"
(let((max-size(or max-size 1024000)))
(if(< max-size (point-max))
   (clog :error "read-line> max-size= %d limit is too small for this large (%d) buffer" max-size (point-max))
#+END_SRC
← protection against too long strings.
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(prog1
  (buffer-substring-no-properties (line-beginning-position) (min max-size(line-end-position)))
  (sforward-line)))))
#+END_SRC

The following characters are safe for file names, as well a s for variable names in most programming languages:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defvar *safe-chars*
(let ((forbidden-symbols '(?\\ ?? ?! ?@ ?# ?$ ?% ?& ?* ?\( ?\) ?+ ?= ?/ ?{ ?} ?\[ ?\] ?: ?\; ?< ?> ?- ?| ?, ?. ?` ?' ?~ ?^ ?\")))
    (append
     (cl-loop for i from ?! to ?~ unless (member i forbidden-symbols) collect i)))
"safe characters for file names: everuthing allowed except for what is forbidden")
(defun *no-digits*(&optional symbols)
  (let((symbols(or symbols *safe-chars*)))
    (cl-loop for c in symbols when (or(< c ?0) (> c ?9)) collect c)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun intToChar(intNumer &optional symbols)
  (let*((symbols(or symbols (*no-digits*))) (lad(length symbols)) divmod)
    (cl-loop do
(setf divmod (cl-floor intNumer lad) intNumer (car divmod))
       collecting (nth (cadr divmod) symbols) into res
       while (> intNumer 0)
       finally (return (concat (reverse res))))))
#+END_SRC

* transpose
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun nth-column(n matrix)
  "returns n-th column of a matrix (n starts from zero)"
  (mapcar #'(lambda(line) (nth n line)) matrix))
(defun transpose(table)
(let((M(length(car table))) result)
(while(<= 0 (cl-decf M))
(push(nth-column M table) result))
result))
#+END_SRC

** Usage example (see also [[https://github.com/chalaev/cloud/blob/master/cloud.org][cloud sync project]])
We define several integer constants for fields in a record characterizing a file:
#+NAME: fileFields
|-------+-------+-------+-------+------+-------+--------|
| plain | uname | gname | mtime | size | modes | cipher |
|     0 |     1 |     2 |     3 |    4 |     5 |      6 |
#+TBLFM: @>=$#-1
← the numbers are assigned automatically when =C-c C-c= with cursor on TBLFM-line.

#+BEGIN_SRC emacs-lisp :tangle generated/example.el
(let
#+END_SRC
←  the list of arguments (variables) is generated automatically from the table:
#+BEGIN_SRC emacs-lisp :var ffs=fileFields :results value code  :results_switches ":tangle example.el :padline no"
(mapcar #'(lambda(l)(list(intern(car l))(cadr l))) (transpose ffs))
#+END_SRC

#+RESULTS:
#+BEGIN_SRC emacs-lisp :tangle example.el :padline no
((plain 0)
 (uname 1)
 (gname 2)
 (mtime 3)
 (size 4)
 (modes 5)
 (cipher 6))
#+END_SRC
Now let as add some meaningless code as an illustration:
#+BEGIN_SRC emacs-lisp :tangle example.el :padline no
(- (* modes cipher) uname gname mtime size))
#+END_SRC
Now =M-x org-babel-tangle= and then in [[file:example.el][example.el]] we find the resulting code.
This is an example of how source code can be generated in literate programming.
